# Understand concepts here

Here first, I will try to understand the concepts using a small data set.

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame([
    {'firstName': 'Jhon', 'lastName': 'Wick', 'gender':'male'},
    {'firstName': 'Jack', 'lastName': 'Sparrow', 'gender':'male'},
    {'firstName': 'Maria', 'lastName': 'Sanchez', 'gender':'female'},
    {'firstName': 'Peter', 'lastName': 'Parker', 'gender':'male'},
])

df.head()

  firstName lastName  gender
0      Jhon     Wick    male
1      Jack  Sparrow    male
2     Maria  Sanchez  female
3     Peter   Parker    male

In [5]:
df.columns = ['first_name', 'last_name', 'gender']
df.head()

  first_name last_name  gender
0       Jhon      Wick    male
1       Jack   Sparrow    male
2      Maria   Sanchez  female
3      Peter    Parker    male

In [6]:
df.columns = [x.upper() for x in df.columns]
df.head()

  FIRST_NAME LAST_NAME  GENDER
0       Jhon      Wick    male
1       Jack   Sparrow    male
2      Maria   Sanchez  female
3      Peter    Parker    male

In [7]:
df['FIRST_NAME'] = [x.upper() for x in df['FIRST_NAME']]
df.head()

  FIRST_NAME LAST_NAME  GENDER
0       JHON      Wick    male
1       JACK   Sparrow    male
2      MARIA   Sanchez  female
3      PETER    Parker    male

In [8]:
df

  FIRST_NAME LAST_NAME  GENDER
0       JHON      Wick    male
1       JACK   Sparrow    male
2      MARIA   Sanchez  female
3      PETER    Parker    male

In [9]:
df.rename(columns={'FIRST_NAME': 'first_name'}, inplace=True)
df.head()

  first_name LAST_NAME  GENDER
0       JHON      Wick    male
1       JACK   Sparrow    male
2      MARIA   Sanchez  female
3      PETER    Parker    male

In [10]:
import pandas as pd

# Define the replacement dictionary
replacement = {"name": "NAME", "age": "Age", "school": "SchOOl"}

# Create a sample DataFrame with a "MainBranch" column
df = pd.DataFrame({"MainBranch": ["I am a name", "I am old", "I go to school"]})

# Replace values in "MainBranch" based on the dictionary
df["MainBranch"] = df["MainBranch"].replace(replacement, regex=True)

# Print the updated DataFrame
print(df)

       MainBranch
0     I am a NAME
1        I am old
2  I go to SchOOl

In [11]:
data = pd.DataFrame({
    "records": ["name", "age", "age", "name", "location", "address"]
})

replacements = {"name": "Naam", "age": "Umar", "location": "jagah"}

def replace_values(value):
    if value in replacements:
        return replacements[value]
    else:
        return None


data["records"] = data["records"].apply(replace_values)
print(data)

  records
0    Naam
1    Umar
2    Umar
3    Naam
4   jagah
5    None

In [12]:
td = pd.DataFrame([
    {'firstName': 'Jhon', 'lastName': 'Wick', 'gender':'male'},
    {'firstName': 'Jack', 'lastName': 'Sparrow', 'gender':'male'},
    {'firstName': 'Maria', 'lastName': 'Sanchez', 'gender':'female'},
    {'firstName': 'Peter', 'lastName': 'Parker', 'gender':'male'},
])
td.head()

  firstName lastName  gender
0      Jhon     Wick    male
1      Jack  Sparrow    male
2     Maria  Sanchez  female
3     Peter   Parker    male

In [13]:
td['firstName'] = td['firstName'].replace({'Jhon': 'A'})
td.head()

  firstName lastName  gender
0         A     Wick    male
1      Jack  Sparrow    male
2     Maria  Sanchez  female
3     Peter   Parker    male

In [14]:
td['full_name'] = td['firstName'] + ' ' + td['lastName']
td.head()

  firstName lastName  gender      full_name
0         A     Wick    male         A Wick
1      Jack  Sparrow    male   Jack Sparrow
2     Maria  Sanchez  female  Maria Sanchez
3     Peter   Parker    male   Peter Parker

In [15]:
td.drop(columns=['firstName', 'lastName'], inplace=True)
td

   gender      full_name
0    male         A Wick
1    male   Jack Sparrow
2  female  Maria Sanchez
3    male   Peter Parker

In [16]:
td[['first_name', 'last_name']] = td['full_name'].str.split(' ', expand=True)
td

   gender      full_name first_name last_name
0    male         A Wick          A      Wick
1    male   Jack Sparrow       Jack   Sparrow
2  female  Maria Sanchez      Maria   Sanchez
3    male   Peter Parker      Peter    Parker

# Trying to understand concat

In [30]:
studentData = pd.DataFrame([
    {'id': 1, 'name': 'Amitav', 'state': 'WB'},
    {'id': 2, 'name': 'Arnav', 'state': 'MH'},
    {'id': 3, 'name': 'Puneet', 'state': 'MH'},
])

result = pd.DataFrame([
    {'id': 1, 'Maths': 80, 'English': 60},
    {'id': 2, 'Maths': 90, 'English': 80},
])

final = pd.concat([studentData, result], axis='columns')
final.head(10)

   id    name state   id  Maths  English
0   1  Amitav    WB  1.0   80.0     60.0
1   2   Arnav    MH  2.0   90.0     80.0
2   3  Puneet    MH  NaN    NaN      NaN